import Header from '../parts/Header.jsx';
import Footer from '../parts/Footer.jsx';

function About() {
    return (
        <>
            <Header/>

            <section className="page-about">
                <div className="about__top mb-5">
                    <h1 className="about__top-title">О нас</h1>
                </div>

                <div className="app-container">
                    <div className="row mb-5">
                        <div className="col-12 col-lg-6 mb-4 mb-lg-0">
                            <div className="about-image">
                                <img src="/images/about-1.jpg" alt=""
                                     className="about-img"/>
                            </div>
                        </div>
                        <div className="col-12 col-lg-6">
                            <div className="about__item-title mb-4">
                                Прочно. Основательно. Надежно.
                            </div>
                            <div className="about__item-text">
                                Прочно. Основательно. Надежно.
                                «Кузница» — крупное, динамично развивающееся
                                производственное предприятие, специализирующееся
                                на
                                изготовлении горячештампованных поковок для
                                сельскохозяйственной, нефтегазовой,
                                машиностроительной,
                                атомной и оборонной промышленности. Современные
                                технические решения, высокий профессионализм
                                сотрудников предприятия позволяют изготавливать
                                продукцию по индивидуальным заказам.
                                Полный цикл изготовления кузнечно-прессовой
                                продукции обеспечивается за счет слаженной
                                работы
                                сотрудников следующих производственных участков
                                и подразделений:
                                Конструкторско-технологическое бюро <br/>
                                Цех изготовления штамповой оснастки <br/>
                                Заготовительный цех <br/>
                                Кузнечно-прессовый цех <br/>
                                Цех термической обработки <br/>
                                Заводская лаборатория
                            </div>
                        </div>
                    </div>

                    <div className="row mb-5">
                        <div className="col-12 col-lg-6 mb-4 mb-lg-0">
                            <div className="about__item-title mb-4">
                                Кузнечно-прессовое производство
                            </div>
                            <div className="about__item-text">
                                Кузнечно-прессовое производство
                                Основным направлением работы завода является
                                производство деталей и изделий из различных
                                металлов,
                                которые находят применение в машиностроении,
                                строительстве, автомобилестроении и многих
                                других
                                отраслях.
                                Оборудование, которым располагает завод,
                                оснащено современными системами управления, что
                                обеспечивает высокую степень контроля над
                                качеством производимых изделий.
                                Кузнечно-прессовое
                                производство нашего завода, сочетает в себе
                                высокую производительность и качество, что
                                делает нас
                                надежным партнером для предприятий различных
                                отраслей.

                            </div>
                        </div>
                        <div className="col-12 col-lg-6">
                            <div className="about-image">
                                <img src="/images/about-2.jpg" alt=""
                                     className="about-img"/>
                            </div>
                        </div>
                    </div>

                    <div className="row mb-5">
                        <div className="col-12 col-lg-6 mb-4 mb-lg-0">
                            <div className="about-image">
                                <img src="/images/about-3.jpg" alt=""
                                     className="about-img"/>
                            </div>
                        </div>
                        <div className="col-12 col-lg-6">
                            <div className="about__item-title mb-4">
                                Механообрабатывающее производство
                            </div>
                            <div className="about__item-text">
                                Наш завод обладает мощным участком механической
                                обработки, который оснащен всеми видами
                                современных
                                металлообрабатывающих станков. Это позволяет нам
                                выполнять широкий спектр работ, от черновой
                                обработки до финишной отделки изделий любой
                                сложности. Нашему парк оборудования, включает
                                токарные,
                                токарно-карусельные, продольно-фрезерные,
                                строгальные, долбежные, зубонарезные,
                                шлифовальные и
                                расточные станки, мы можем предложить решения
                                для любых производственных задач.
                                Этот арсенал позволяет нам осуществлять полный
                                цикл обработки металлических изделий — от
                                первичной
                                подготовки заготовки до финальной доводки. Наши
                                специалисты имеют многолетний опыт работы с
                                самыми
                                сложными проектами, что обеспечивает неизменно
                                высокое качество исполнения заказов.
                            </div>
                        </div>
                    </div>

                    <div className="row mb-5">
                        <div className="col-12 col-lg-6 mb-4 mb-lg-0">
                            <div className="about__item-title mb-4">
                                Термическое производство
                            </div>
                            <div className="about__item-text">
                                Предприятие располагает современным
                                оборудованием по термической обработке. Цех
                                термической
                                обработки, оснащён современным пятикамерным
                                агрегатом. Это оборудование позволяет
                                предприятию
                                осуществлять повышение качества металлопродукции
                                через специализированные методы термической
                                обработки. Ванны оборудованы системой барботажа
                                обеспечивающей равномерность закалки благодаря
                                интенсивному перемешиванию жидкости.
                                Автоматическая система поддерживает строго
                                заданную температуру
                                закалочного раствора, минимизируя отклонения и
                                повышая стабильность процесса.
                                Производительность предприятия реализуется
                                так-же благодаря использованию специального
                                манипулятора
                                — полукозлового крана, позволяющего быстро
                                перемещать заготовки, сокращая время
                                технологического
                                цикла.
                            </div>
                        </div>
                        <div className="col-12 col-lg-6">
                            <div className="about-image">
                                <img src="/images/about-4.jpg" alt=""
                                     className="about-img"/>
                            </div>
                        </div>
                    </div>

                    <div className="row">
                        <div className="col-12 col-lg-6 mb-4 mb-lg-0">
                            <div className="about-image">
                                <img src="/images/about-5.jpg" alt=""
                                     className="about-img"/>
                            </div>
                        </div>
                        <div className="col-12 col-lg-6">
                            <div className="about__item-title mb-4">
                                Центральная заводская лаборатория
                            </div>
                            <div className="about__item-text">
                                Заводская лаборатория оснащена современным
                                испытательным оборудованием, позволяющим
                                проводить
                                различные виды испытаний изделий методом
                                разрушающего и неразрушающего контроля
                                испытания на растяжение, сжатие, изгиб,
                                циклических испытаний, на усталость при
                                постоянной нагрузке
                                (Максимальное усилие оборудования QUASAR 100 -
                                100 кН);
                                контроль ударной вязкости материала и
                                соответствие металла выбранному стандарту
                                качества
                                (Современная установка - маятниковый копер
                                IMPACT с энергией удара 300 Дж );
                                исследования микроструктуры металлов и качества
                                поверхности (программно-аппаратный комплекс
                                Thixomet).
                                спектральный анализ материалов, контроль
                                поступающей стали на содержание примесей
                                (оптико-эмиссионный спектрометр ARL 3460);
                                неразрушающий ультразвуковой и вихретоковый
                                контроль изделий;
                                возможность проведения испытаний при повышенной
                                и пониженной температурах.
                            </div>
                        </div>
                    </div>
                </div>
            </section>

            <section>
                <div className="form">
                    <div className="app-container">
                        <h2 className="form-title">Свяжитесь с нами по любым
                            вопросам</h2>
                        <div className="form-text">Мы всегда рады коллаборациям,
                            интересным проектам и отзывам наших клиентов
                        </div>
                        <form action="" className="form__wrapper">
                            <div className="form-input__wrap">
                                <input type="text" className="form-input"
                                       placeholder="Ваше имя"/>
                            </div>
                            <div className="form-input__wrap">
                                <input type="text" className="form-input"
                                       placeholder="Ваш E-mail"/>
                            </div>
                            <div className="form-input__wrap">
                                <textarea className="form-textarea"
                                          placeholder="Text"></textarea>
                            </div>
                            <button className="form-btn">Отправить</button>
                        </form>
                        <div className="form-personal">Нажимая на кнопку, вы
                            даете согласие на обработку персональных данных и
                            соглашаетесь c политикой конфиденциальности
                        </div>
                    </div>
                </div>
            </section>

            <Footer/>
        </>
    );
}

export default About;